Repository: snorkel-marlin-repos/gaphor_gaphor_pr_2203_ddb0fbc9-296b-4b31-a165-4eb3afeef209
Catalog: po/*.po
Languages: es

source: C4 Model
es: Modelo C4

source: Description
es: Descripción

source: Technology
es: Tecnología

source: New Software System
es: Sistema de software nuevo

source: New Container
es: Contenedor nuevo

source: Database
es: Base de datos

source: New Database
es: Base de datos nueva

source: New Component
es: Componente nuevo

source: Person
es: Persona

source: Software System
es: Sistema de software

source: Container
es: Contenedor

source: Container: Database
es: Contenedor: Base de datos

source: Component
es: Componente

source: Dependency
es: Dependencia

source: New C4 Diagram
es: Diagrama C4 nuevo

source: New Class Diagram
es: Diagrama de clase nuevo

source: New Activity Diagram
es: Diagrama de actividad nuevo

source: New Sequence Diagram
es: Diagrama de secuencia nuevo

source: New State Machine Diagram
es: Diagrama de la máquina de estado nuevo

source: New FTA Diagram
es: Diagrama FTA nuevo

source: New STPA Diagram
es: Diagrama STPA nuevo

source: AND Gate
es: Puerta AND

source: Basic Event
es: Evento básico

source: Conditional Event
es: Evento condicional

source: Dormant Event
es: Evento inactivo

source: Fault Tree Analysis
es: Análisis del árbol de fallos

source: OR Gate
es: Puerta OR

source: NOT Gate
es: Puerta NOT

source: Sequence Enforcing (SEQ) Gate
es: Puerta de aplicación de la secuencia (SEQ)

source: Exclusive OR Gate
es: Puerta OR exclusiva

source: Majority Vote Gate
es: Puerta del voto mayoritario

source: Inhibit Gate
es: Puerta inhibida

source: Transfer In
es: Transferir a

source: Transfer Out
es: Transferir desde

source: Undeveloped Event
es: Evento sin desarrollar

source: House Event
es: Evento en casa

source: Zero Event
es: Evento cero

source: Top Event
es: Evento superior

source: Intermediate Event
es: Evento intermedio

source: Sequence Enforcing Gate
es: Puerta de aplicación de la secuencia

source: XOR Gate
es: Puerta XOR

source: Control Action
es: Acción de control

source: Operational Situation
es: Situación operativa

source: Loss
es: Pérdida

source: Hazard
es: Riesgo

source: Abstract Operational Situation
es: Situación operativa abstracta

source: Generalization
es: Generalización

source: Situation
es: Situación

source: Control Structure
es: Estructura de control

source: Controller
es: Controlador

source: Actuator
es: Actuador

source: Controlled Process
es: Proceso controlado

source: Unsafe Control Action
es: Acción de control no segura

source: Relevant To
es: Relevante para

source: Item Flow
es: Flujo del elemento

source: Item Property
es: Propiedad del elemento

source: Invert direction
es: Invertir dirección

source: Allocated Type
es: Tipo asignado

source: Compartments
es: Compartimentos

source: Show Parts
es: Mostrar partes

source: Show References
es: Mostrar referencias

source: Show Values
es: Mostrar valores

source: Aggregation
es: Agregación

source: No aggregation
es: No hay agregación

source: Shared
es: Compartido

source: Composite
es: Compuesto

source: Text
es: Texto

source: Internal Blocks
es: Bloques internos

source: Connector
es: Conector

source: Property
es: Propiedad

source: Proxy Port
es: Puerto proxy

source: New Block Definition Diagram
es: Diagrama de definición de bloques nuevo

source: New Internal Block Diagram
es: Diagrama de bloques internos nuevo

source: New Package Diagram
es: Diagrama de paquete nuevo

source: New Requirement Diagram
es: Diagrama de requisitos nuevo

source: New Use Case Diagram
es: Diagrama de casos de uso nuevo

source: ControlStructure
es: EstructuraControl

source: block
es: bloque

source: parts
es: partes

source: references
es: referencias

source: values
es: valores

source: unnamed
es: sin nombre

source: Blocks
es: Bloques

source: Block
es: Bloque

source: Package
es: Paquete

source: Composite Association
es: Asociación de compuestos

source: Shared Association
es: Asociación compartida

source: Association
es: Asociación

source: ValueType
es: TipoValor

source: Enumeration
es: Enumeración

source: Primitive
es: Primitivo

source: satisfy
es: satisfacer

source: trace
es: trazar

source: verify
es: verificar

source: refine
es: refinar

source: requirement
es: requisito

source: Requirements
es: Requisitos

source: Requirement
es: Requisito

source: Satisfy
es: Satisfacer

source: Derive Requirement
es: Derivación de requisitos

source: Trace
es: Trazar

source: Refine
es: Refinar

source: Verify
es: Verificar

source: Containment
es: Contención

source: Removed unused elements from the model: they are not used in any other diagram.
es: Se han eliminado los elementos no usados del modelo: no se usan en ningún otro diagrama.

source: New Component Diagram
es: Diagrama de componentes nuevo

source: New Deployment Diagram
es: Diagrama de despliegue nuevo

source: New Communication Diagram
es: Diagrama de comunicación nuevo

source: New Profile Diagram
es: Diagrama de perfil nuevo

source: New {name}
es: {name} nuevo

source: supplier: {name}
es: proveedor: {name}

source: extend: {name}
es: extender: {name}

source: include: {name}
es: incluir: {name}

source: Activity
es: Actividad

source: Swimlane One
es: Swimlane uno

source: Swimlane Two
es: Swimlane dos

source: Actions
es: Acciones

source: Action
es: Acción

source: Initial node
es: Nodo inicial

source: Activity final node
es: Nodo final de la actividad

source: Flow final node
es: Nodo final del flujo

source: Decision/merge node
es: Nodo de decisión/fusión

source: Fork/join node
es: Nodo de bifurcación/unión

source: Object node
es: Nodo objeto

source: Control flow
es: Flujo de control

source: Object flow
es: Flujo de objetos

source: Send signal action
es: Enviar la acción de la señal

source: Send signal
es: Enviar señal

source: Accept event action
es: Aceptar la acción del evento

source: Accept event
es: Aceptar evento

source: Input pin
es: Pin de entrada

source: Output pin
es: Pin de salida

source: merge/decision
es: fusión/decisión

source: merge
es: fusión

source: decision
es: decisión

source: unordered
es: desordenado

source: ordered
es: ordenado

source: New Swimlane
es: Swimlane nuevo

source: input pin
es: pin de entrada

source: output pin
es: pin de salida

source: Show type
es: Mostrar tipo

source: Join Specification
es: Especificación de unión

source: Partitions
es: Particiones

source: Upper Bound
es: Límite superior

source: Show Ordering
es: Mostrar orden

source: Name
es: Nombre

source: Guard
es: Guardia

source: Parameter Nodes
es: Nodos de parámetros

source: Parameters
es: Parámetros

source: 🛈 Help
es: 🛈 Ayuda

source: Add and edit class activity according to UML syntax. • <tt>attr</tt> (name, defaults to public visibility) • <tt>+ attr: int</tt> (public with type) • <tt>+ attr: int[0..1]</tt> (public, type, and multiplicity) • <tt>+ attr: int | bool</tt> (public, union type) • <tt># /attr: int # a note</tt> (protected, derived, with remark) Press <b>Enter</b> to edit, <b>Backspace</b>/<b>Delete</b> to remove items. Use <b>-</b>/<b>=</b> to move items up or down.
es: Añada y edite los atributos de la clase según la sintaxis UML. • <tt>attr</tt> (nombre, predeterminado a la visibilidad pública) • <tt>+ attr: int</tt> (público con tipo) • <tt>+ attr: int[0..1]</tt> (público, tipo, y multiplicidad) • <tt>+ attr: int | bool</tt> (public, union type) • <tt># /attr: int # una nota</tt> (protegidas, derivadas, con observación) Pulse <b>Enter</b> to edit, <b>Retroceso</b>/<b>Eliminar</b> para eliminar elementos. Use <b>-</b>/<b>=</b> para mover elementos arriba o abajo.

source: Static
es: Estática

source: Abstract
es: Abstracta

source: Classes
es: Clases

source: Class
es: Clase

source: Interface
es: Interfaz

source: Interface Realization
es: Realización de la interfaz

source: DataType
es: TipoDato

source: primitive
es: primitivo

source: valueType
es: tipoValor

source: dataType
es: tipoDato

source: use
es: usar

source: realize
es: realizar

source: implements
es: implementa

source: Usage
es: Uso

source: Realization
es: Realización

source: Implementation
es: Implementación

source: enumeration
es: enumeración

source: interface
es: interfaz

source: stereotype
es: estereotipo

source: metaclass
es: metaclase

source: profile
es: perfil

source: Show Direction
es: Mostrar dirección

source: Head:
es: Cabeza:

source: Add and edit association ends according to UML syntax. • <tt>+ name</tt> • <tt>+ name[1]</tt> • <tt>- name[1..2]</tt> • <tt>1..2</tt> • <tt>- [1..2]</tt> Press <b>Enter</b> to edit, <b>Backspace</b>/<b>Delete</b> to remove items. Use <b>-</b>/<b>=</b> to move items up or down.
es: Añada y edite los extremos de la asociación de acuerdo con la sintaxis UML. • <tt>+ nombre</tt> • <tt>+ nombre[1]</tt> • <tt>- nombre[1..2]</tt> • <tt>1..2</tt> • <tt>- [1..2]</tt> Pulse <b>Enter</b> para editar, <b>Retroceso</b>/<b>Eliminar</b> para eliminar elementos. Use <b>-</b>/<b>=</b> para mover elementos arriba o abajo.

source: Unknown navigation
es: Navegación desconocida

source: Not navigable
es: No navegable

source: Navigable
es: Navegable

source: Attributes
es: Atributos

source: Value
es: Valor

source: Tail:
es: Cola:

source: Show Attributes
es: Mostrar atributos

source: Add and edit class attributes according to UML syntax. • <tt>attr</tt> (name, defaults to public visibility) • <tt>+ attr: int</tt> (public with type) • <tt>+ attr: int[0..1]</tt> (public, type, and multiplicity) • <tt>+ attr: int | bool</tt> (public, union type) • <tt># /attr: int # a note</tt> (protected, derived, with remark) Press <b>Enter</b> to edit, <b>Backspace</b>/<b>Delete</b> to remove items. Use <b>-</b>/<b>=</b> to move items up or down.
es: Añada y edite los atributos de la clase según la sintaxis UML. • <tt>attr</tt> (nombre, predeterminado a la visibilidad pública) • <tt>+ attr: int</tt> (público con tipo) • <tt>+ attr: int[0..1]</tt> (público, tipo, y multiplicidad) • <tt>+ attr: int | bool</tt> (public, union type) • <tt># /attr: int # una nota</tt> (protegidas, derivadas, con observación) Pulse <b>Enter</b> to edit, <b>Retroceso</b>/<b>Eliminar</b> para eliminar elementos. Use <b>-</b>/<b>=</b> para mover elementos arriba o abajo.

source: Dependency type
es: Tipo de dependencia

source: Automatic
es: Automática

source: Folded
es: Plegada

source: Operations
es: Operaciones

source: Show Operations
es: Mostrar operaciones

source: Add and edit class operations according to UML syntax. • <tt>call()</tt> • <tt>+ call(a: int[*], b: str): bool</tt> (public, parameters) • <tt># call(a: int, b: str) # a note</tt> (protected, with remark) Press <b>Enter</b> to edit, <b>Backspace</b>/<b>Delete</b> to remove items. Use <b>-</b>/<b>=</b> to move items up or down.
es: Añada y edite los atributos de la clase según la sintaxis UML. • <tt>call()</tt> • <tt>+ call(a: int[*], b: str): bool</tt> (público, parámetros) • <tt># call(a: int, b: str) # a note</tt> (protegido, con observación) Pulse <b>Enter</b> to edit, <b>Retroceso</b>/<b>Eliminar</b> para eliminar elementos. Use <b>-</b>/<b>=</b> para mover elementos arriba o abajo.

source: Enumeration Literals
es: Literales de enumeración

source: Show Enumeration Literals
es: Mostrar literales de enumeración

source: Add and edit enumeration literals according to UML syntax. • <tt>enum</tt> Press <b>Enter</b> to edit, <b>Backspace</b>/<b>Delete</b> to remove items. Use <b>-</b>/<b>=</b> to move items up or down.
es: Añada y edite los atributos de la clase según la sintaxis UML. • <tt>enum</tt> Pulse <b>Enter</b> to edit, <b>Retroceso</b>/<b>Eliminar</b> para eliminar elementos. Use <b>-</b>/<b>=</b> para mover elementos arriba o abajo.

source: Indirectly Instantiated
es: Instanciada indirectamente

source: Deployments
es: Despliegues

source: Artifact
es: Artefacto

source: Node
es: Nodo

source: Device
es: Dispositivo

source: device
es: dispositivo

source: Information Flow
es: Flujo de información

source: Information Item (Class)
es: Elemento de información (clase)

source: Interaction
es: Interacción

source: Interactions
es: Interacciones

source: Lifeline
es: Línea de vida

source: Execution Specification
es: Especificación de la ejecución

source: Message
es: Mensaje

source: Reflexive message
es: Mensaje reflexivo

source: Message Sort
es: Orden de los mensajes

source: import
es: importar

source: Profiles
es: Perfiles

source: Profile
es: Perfil

source: Metaclass
es: Metaclase

source: Stereotype
es: Estereotipo

source: Extension
es: Extensión

source: Import
es: Importar

source: Stereotypes
es: Estereotipos

source: Show Stereotypes
es: Mostrar estereotipos

source: Activities
es: Actividades

source: Entry
es: Entrada

source: Exit
es: Salida

source: Do Activity
es: Hacer actividad

source: Regions
es: Regiones

source: Show Regions
es: Mostrar regiones

source: statemachine
es: máquinaestados

source: State
es: Estado

source: State Machine
es: Máquina de estados

source: States
es: Estados

source: Initial Pseudostate
es: Pseudoestado inicial

source: Final State
es: Estado final

source: Transition
es: Transición

source: Shallow History Pseudostate
es: Pseudoestado de historia superficial

source: Deep History Pseudostate
es: Pseudoestado de historia profunda

source: Join Pseudostate
es: Unir pseudoestado

source: Fork Pseudostate
es: Bifurcar pseudoestado

source: Junction Pseudostate
es: Enlazar pseudoestado

source: Choice Pseudostate
es: Elección de pseudoestado

source: Entry Point Pseudostate
es: Punto de entrada pseudoestado

source: Exit Point Pseudostate
es: Punto de salida pseudoestado

source: Terminate Pseudostate
es: Terminar pseudoestado

source: extend
es: extender

source: include
es: incluir

source: Use Cases
es: Casos de uso

source: Use case
es: Caso de uso

source: Include
es: Incluir

source: Extend
es: Extender

source: Pointer
es: Puntero

source: Line
es: Línea

source: Box
es: Caja

source: Ellipse
es: Elipse

source: Comment
es: Comentario

source: Comment line
es: Línea de comentario

source: Diagram metadata
es: Metadatos del diagrama

source: (from {namespace})
es: (de {namespace})

source: Style
es: Estilo

source: Rectilinear
es: Rectilínea

source: Flip orientation
es: Orientación del giro

source: Note or Remark
es: Nota o comentario

source: Created By
es: Creado por

source: Website
es: Página web

source: Revision
es: Revisión

source: License
es: Licencia

source: Created On
es: Creado el

source: Updated On
es: Actualizado el

source: Element can’t be represented on a diagram.
es: El elemento no se puede representar en un diagrama.

source: No model file configured for model '{model_name}'.
es: No hay archivo de modelo configurado para el modelo '{model_name}'.

source: No diagram '{name}' in model '{model_name}' ({model_file}).
es: No hay diagrama '{name}' en el modelo '{model_name}' ({model_file}).

source: Auto Layout
es: Disposición automática

source: Auto Layout (orthogonal)
es: Disposición automática (ortogonal)

source: Gaphor Interactive Python Console {version} Type "help" for more information.
es: Consola interactiva de Python de Gaphor {version} Escriba "help" para obtener más información.

source: Gaphor Console
es: Consola de Gaphor

source: Console
es: Consola

source: All {ext} Files
es: Todos los archivos {ext}

source: Export as SVG
es: Exportar como SVG

source: Export diagram as SVG
es: Exportar diagrama como SVG

source: Export as PNG
es: Exportar como PNG

source: Export diagram as PNG
es: Exportar diagrama como SVG

source: Export as PDF
es: Exportar como PDF

source: Export diagram as PDF
es: Exportar diagrama como PDF

source: Export as EPS
es: Exportar como EPS

source: Export diagram as Encapsulated PostScript
es: Exportar diagrama como PostScript encapsulado

source: Export diagram as EPS
es: Exportar diagrama como EPS

source: Error Reports
es: Informes de errores

source: No errors have been intercepted. We’re good.
es: No se ha interceptado ningún error. Estamos bien.

source: Errors:
es: Errores:

source: An unexpected error occurred. Please file an issue on GitHub and include information from Tools → Error Reports.
es: Se ha producido un error inesperado. Presente una incidencia en GitHub e incluya la información de Herramientas → Informes de error.

source: Any unhandled errors are shown here. You can use these to provide extra information when you create an issue on GitHub.
es: Cualquier error no manejado se muestra aquí. Puede usarlos para proporcionar información adicional cuando cree una incidencia en GitHub.

source: Export as XMI
es: Exportar como XMI

source: Export model as XMI (XML Model Interchange) format
es: Exportar modelo como formato XMI (XML Model Interchange)

source: Export model as XMI file
es: Exportar modelo como archivo XMI

source: All XMI Files
es: Todos los archivos XMI

source: New model
es: Modelo nuevo

source: New diagram
es: Diagrama nuevo

source: 1. Context diagrams
es: 1. Diagramas de contexto

source: 2. Container diagrams
es: 2. Diagramas de contenedores

source: 4. Code diagrams
es: 4. Diagramas de códigos

source: 3. Component diagrams
es: 3. Diagramas de componentes

source: Context diagram
es: Diagrama de contexto

source: Container diagram
es: Diagrama del contenedor

source: Component diagram
es: Diagrama de componentes

source: Code diagram
es: Diagrama de códigos

source: Model Name Here
es: Nombre del modelo aquí

source: Loss Definition
es: Definición de la pérdida

source: Loss of System
es: Pérdida del sistema

source: Loss of Subsystem 1
es: Pérdida del subsistema 1

source: Loss of Subsystem 2
es: Pérdida del subsistema 2

source: Hazard Definition
es: Definición de riesgo

source: Loss of Life or Injury of People
es: Pérdida de vidas o lesiones de personas

source: Loss of Mission
es: Pérdida de la misión

source: Loss of Customer Satisfaction
es: Pérdida de la satisfacción del cliente

source: Hazard 2
es: Riesgo 2

source: Hazard 1
es: Riesgo 1

source: Mapping of Losses and Hazards
es: Cartografía de pérdidas y riesgos

source: Operational Situations
es: Situaciones operativas

source: Operational Situation 1
es: Situación operativa 1

source: Context of UCAs
es: Contexto de las UCAs

source: Situational Context
es: Contexto situacional

source: Situation Hierarchy
es: Jerarquía de situaciones

source: The fault tree analysis shows which causes for the failure of a system have been considered.
es: El análisis del árbol de fallos muestra qué causas de fallo de un sistema se han tenido en cuenta.

source: 1. Concept Level
es: 1. Nivel de concepto

source: 2. Logical Level
es: 2. Nivel lógico

source: 3. Technology Level
es: 3. Nivel tecnológico

source: User
es: Usuario

source: Use Case #1
es: Caso de uso #1

source: Behavior
es: Comportamiento

source: Structure
es: Estructura

source: Feature Context
es: Contexto de la característica

source: Operator
es: Operador

source: Feature
es: Característica

source: External Element
es: Elemento externo

source: Stakeholder Requirements
es: Requisitos de los interesados

source: Feature User Need
es: Característica que necesita el usuario

source: Logical Structure
es: Estructura lógica

source: controller
es: controlador

source: Logical Boundary
es: Límite lógico

source: Technology Structure
es: Estructura tecnológica

source: Technology Boundary
es: Límite tecnológico

source: Technology Requirements
es: Requisitos tecnológicos

source: Detailed Behavior
es: Comportamiento detallado

source: System Requirements
es: Requisitos del sistema

source: Logical States
es: Estados lógicos

source: Feature Event Flow
es: Flujo de eventos de características

source: Off
es: Apagado

source: On
es: Encendido

source: actuator
es: accionador

source: Use Case Function #1
es: Función de caso de uso #1

source: First Action
es: Primera acción

source: Second Action
es: Segunda acción

source: Example System Requirement
es: Ejemplo de requisito del sistema

source: Sensed Data
es: Datos detectados

source: Command
es: Comando

source: Functional Boundary Behavior
es: Comportamiento del límite funcional

source: Determine Actuator Command
es: Determinar el comando del actuador

source: Actuate Actuator
es: Actuador de la acción

source: Actuator Command
es: Comando del actuador

source: Example Technology Requirement
es: Ejemplo de requisito tecnológico

source: System
es: Sistema

source: DC Motor
es: Motor de CC

source: IR Transceiver
es: Transceptor de infrarrojos

source: dc Motor
es: Motor de cc

source: ir Transceiver
es: Transceptor de infrarrojos

source: Detect Obstacle
es: Detectar obstáculo

source: Command Reverse
es: Comando de inversión

source: Reverse Motor
es: Motor de reversión

source: Detect Object
es: Detectar objeto

source: Detection Event
es: Evento de detección

source: 1. Use Cases
es: 1. Casos de uso

source: 2. Domain Analysis
es: 2. Análisis del dominio

source: 3. Architectural Design
es: 3. Diseño estructural

source: 4. Detailed Design
es: 4. Diseño detallado

source: Main Actor
es: Actor principal

source: Main Use Case
es: Caso de uso principal

source: Included Use Case
es: Caso de uso incluido

source: Secondary Actor
es: Actor secundario

source: Secondary Use Case
es: Caso de uso secundario

source: Use Case Scenarios
es: Escenarios de casos de uso

source: Scenario 1
es: Escenario 1

source: Scenario 2
es: Escenario 2

source: Domain Entities
es: Entidades del dominio

source: Software Task
es: Tarea de software

source: performs
es: realiza

source: Package Dependencies
es: Dependencias del paquete

source: SW Component 1
es: Componente SW 1

source: SW Component 4
es: Componente SW 4

source: SW Component 3
es: Componente SW 3

source: SW Component 2
es: Componente SW 2

source: Primary Actor
es: Actor principal

source: Actor Profile
es: Perfil del actor

source: login
es: inicio de sesión

source: Detailed Class Design
es: Diseño detallado de la clase

source: First Class
es: Primera clase

source: firstName
es: nombre

source: lastName
es: apellidos

source: Login
es: Inicio de sesión

source: lastLogin
es: últimoInicio

source: Second Class
es: Segunda clase

source: released
es: publicado

source: Implementation Architecture
es: Arquitectura de la implementación

source: Node 1
es: Nodo 1

source: Artifact 1
es: Artefacto 1

source: Node 2
es: Nodo 2

source: protocol
es: protocolo

source: Artifact 2
es: Artefacto 2

source: Analyze functional requirements by identifying user roles – actors – and associating them to their use cases.
es: Analizar los requisitos funcionales identificando los roles de los usuarios — actores — y asociándolos a sus casos de uso.

source: Model abstract use case implementation by creating activity diagrams visualizing activity flows for primary and secondary use case scenarios.
es: Modelar la implementación de casos de uso abstractos mediante la creación de diagramas de actividad que visualicen los flujos de actividad para los escenarios de casos de uso primarios y secundarios.

source: Perform domain analysis by modeling domain entities and their relationships using simplified class diagram. This diagram will serve as a visual dictionary of concepts. It will also be a starting point for your design-level data model.
es: Realizar el análisis del dominio modelando las entidades del dominio y sus relaciones mediante un diagrama de clases simplificado. Este diagrama servirá como diccionario visual de conceptos. También será un punto de partida para su modelo de datos a nivel de diseño.
