Repository: snorkel-marlin-repos/gaphor_gaphor_pr_2203_ddb0fbc9-296b-4b31-a165-4eb3afeef209
Catalog: po/*.po
Languages: es

source: Prepare package dependencies diagram to group your implementation classes in appropriate way. This will help you maintain the code well structured and avoid design flaws such as cyclic dependencies or dependencies on unstable parts
es: Prepare el diagrama de dependencias del paquete para agrupar sus clases de implementación de forma adecuada. Esto le ayudará a mantener el código bien estructurado y a evitar fallos de diseño como dependencias cíclicas o dependencias de partes inestables

source: Model component interactions for use case scenarios in order to find out new methods in existing classes or even new classes with specific responsibilities.
es: Modelar las interacciones de los componentes para los escenarios de casos de uso con el fin de encontrar métodos nuevos en clases existentes o incluso clases nuevas con responsabilidades específicas.

source: Create detailed class diagrams to capture your object-oriented data model.
es: Cree diagramas de clase detallados para capturar su modelo de datos orientado a objetos.

source: Define the major artifacts that manifest implementation of your components. Indicate how they are deployed on hardware nodes, their inter-dependencies and communication protocols.
es: Defina los principales artefactos que manifiestan la implementación de sus componentes. Indique cómo se despliegan en los nodos de hardware, sus interdependencias y los protocolos de comunicación.

source: String
es: Cadena

source: Date
es: Fecha

source: All Gaphor Models
es: Todos los modelos Gaphor

source: Switch to {name}?
es: ¿Cambiar a {name}?

source: {name} is already opened. Do you want to switch to the opened window instead?
es: {name} ya está abierto. ¿Quiere cambiar a la ventana abierta en su lugar?

source: Open Again
es: Abrir de nuevo

source: Switch
es: Cambiar

source: Open a Model
es: Abrir un modelo

source: <None>
es: <none></none>

source: Open a Diagram
es: Abrir un diagrama

source: Open a diagram from the model browser, or create a new diagram from the New diagram menu.
es: Abrir un diagrama desde el navegador de modelos, o crear un diagrama nuevo desde el menú Diagrama nuevo.

source: No item selected
es: Ningún elemento seleccionado

source: Show Tips
es: Mostrar consejos

source: Add a model element from the tool box (bottom left) to the diagram. Here you will see it's properties appear.
es: Añade un elemento del modelo desde la caja de herramientas (abajo a la izquierda) al diagrama. Aquí verás que aparecen sus propiedades.

source: This pane can be hidden by clicking the pane icon in the header.
es: Este panel puede ocultarse haciendo clic en el icono de panel de la cabecera.

source: <b>Tip:</b> Most elements in the toolbox have a keyboard shortcut (e.g. "c" for Class). Tool selection only works from the diagram. If a tool does not get selected, click on the diagram once (so it's focused) and then hit the shortcut key.
es: <b>Consejo:</b> La mayoría de los elementos de la caja de herramientas tienen un atajo del teclado (por ejemplo, "c" para Clase). La selección de herramientas sólo funciona desde el diagrama. Si una herramienta no se selecciona, haga clic en el diagrama una vez (para que esté enfocado) y luego pulse la tecla de acceso directo.

source: <b>Tip:</b> To search for an element in the model browser (top left), select an element in the model browser and start typing. A search box will automatically appear.
es: <b>Consejo:</b> Para buscar un elemento en el navegador de modelos (arriba a la izquierda), seleccione un elemento en el navegador de modelos y empiece a escribir. Aparecerá automáticamente un cuadro de búsqueda.

source: Undo
es: Deshacer

source: Redo
es: Rehacer

source: Zoom In
es: Ampliar

source: Actual Size
es: Tamaño real

source: Zoom Out
es: Alejar

source: Editors
es: Editores

source: Preferences
es: Preferencias

source: Reset Tool Automatically
es: Restablecer la herramienta automáticamente

source: Remove Unused Elements
es: Eliminar los elementos no usados

source: Automatically remove elements no longer in use in any diagram.
es: Eliminar automáticamente los elementos que ya no se usan en cualquier diagrama.

source: Style Sheet
es: Hoja de estilo

source: 🔗 <a href="https://gaphor.readthedocs.io/en/latest/style_sheets.html">Style sheets in Gaphor</a>
es: 🔗 <a href="https://gaphor.readthedocs.io/en/latest/style_sheets.html">Hojas de estilo en Gaphor</a>

source: Merge Models
es: Combinar modelos

source: Merge Model Changes
es: Combinar cambios de modelo

source: Apply incoming changes from the conflicting model. Use Undo to revert changes.
es: Aplique los cambios entrantes del modelo en conflicto. Use Deshacer para revertir los cambios.

source: Resolve
es: Resolver

source: It looks like Gaphor is started from the command line. Do you want to open a debug session?
es: Parece que Gaphor se inicia desde la línea de comandos. ¿Quiere abrir una sesión de depuración?

source: Close
es: Cerrar

source: Start Debug Session
es: Iniciar sesión de depuración

source: All Files
es: Todos los archivos

source: Gaphor was not able to store the model, probably due to an internal error: {exc} If you think this is a bug, please contact the developers.
es: Gaphor no ha podido almacenar el modelo, probablemente debido a un error interno: {exc} Si cree que se trata de un error, póngase en contacto con los desarrolladores.

source: You do not have the permissions necessary to save the model. Please check that you typed the location correctly and try again.
es: No tiene los permisos necesarios para guardar el modelo. Por favor, compruebe que ha escrito la ubicación correctamente y vuelva a intentarlo.

source: You do not have enough free space on the device to save the model. Please free up some disk space and try again or save it in a different location.
es: No tiene suficiente espacio libre en el dispositivo para guardar el modelo. Por favor, libere algo de espacio en el disco y vuelva a intentarlo o guárdelo en una ubicación diferente.

source: The model cannot be stored at this location: {exc} Please check that you typed the location correctly and try again.
es: El modelo no puede ser almacenado en esta ubicación: {exc} Por favor, compruebe que ha introducido la ubicación correctamente y vuelva a intentarlo.

source: Loading…
es: Cargando…

source: Loading model from {filename}
es: Cargando modelo desde {filename}

source: Loading current and incoming model
es: Cargando modelo actual y entrante

source: Unable to open model “{filename}”.
es: No se ha podido abrir el modelo "{filename}".

source: This file does not contain a valid Gaphor model.
es: Este archivo no contiene un modelo válido de Gaphor.

source: Saving…
es: Guardando…

source: Saving model to {filename}
es: Guardando el modelo en {filename}

source: Unable to save model “{filename}”.
es: No se ha podido guardar el modelo "{filename}".

source: Save Gaphor Model As
es: Guardar el modelo Gaphor como

source: Resolve Merge Conflict?
es: ¿Resolver el conflicto de fusión?

source: The model you are opening contains a merge conflict. Do you want to open the current model or the incoming change to the model?
es: El modelo que está abriendo contiene un conflicto de fusión. ¿Desea abrir el modelo actual o el cambio entrante en el modelo?

source: Cancel
es: Cancelar

source: Open Merge Editor
es: Abrir el editor de combinación

source: Open Current
es: Abrir corriente

source: Open Incoming
es: Abrir entrante

source: Save Changes?
es: ¿Guardar cambios?

source: The open model contains unsaved changes. Changes which are not saved will be permanently lost.
es: El modelo abierto contiene cambios no guardados. Los cambios que no se guarden se perderán permanentemente.

source: Discard
es: Descartar

source: Save
es: Guardar

source: Generic
es: Genérico

source: An empty model
es: Un modelo vacío

source: Unified Modeling Language template
es: Plantilla de Lenguaje Unificado de Modelado

source: Systems Modeling Language template
es: Plantilla de Lenguaje de Modelado de Sistemas

source: Risk Analysis and Assessment Modeling Language template
es: Plantilla de Lenguaje de Modelado de Análisis y Evaluación de Riesgos

source: Layered C4 Model template
es: Plantilla de modelo C4 por capas

source: Open Model…
es: Abrir modelo…

source: Keyboard Shortcuts
es: Atajos del teclado

source: About Gaphor
es: Acerca de Gaphor

source: Recently Opened
es: Abierto recientemente

source: Create New Model
es: Crear modelo nuevo

source: New Model…
es: Modelo nuevo…

source: Save As…
es: Guardar como…

source: Export
es: Exportar

source: Tools
es: Herramientas

source: Profile: {name}
es: Perfil: {name}

source: New diagram menu
es: Menú del diagrama nuevo

source: Open application menu
es: Abrir el menú de la aplicación

source: Toggle property editor
es: Conmutar el editor de propiedades

source: {name} package
es: Paquete {name}

source: New package
es: Paquete nuevo

source: New _Package
es: _Paquete nuevo

source: _Open
es: _Abrir

source: Add to diagram
es: Añadir al diagrama

source: _Rename
es: _Renombrar

source: New _Diagram
es: _Diagrama nuevo

source: De_lete
es: _Borrar

source: Show in “{diagram}”
es: Mostrar en "{diagram}"

source: New Generic Diagram
es: Diagrama genérico nuevo

source: Copyright © 2001-2023 Arjan J. Molenaar and Dan Yeaw. UML, SysML, and RAAML are either registered trademarks or trademarks of Object Management Group, Inc. in the United States and/or other countries.
es: Copyright © 2001-2023 Arjan J. Molenaar y Dan Yeaw. UML, SysML y RAAML son marcas registradas o marcas comerciales de Object Management Group, Inc. en Estados Unidos y/o en otros países.

source: Licensed under the Apache License, Version 2.0 (the "License"); you may not use this application except in compliance with the License. You may obtain a copy of the License at http://www.apache.org/licenses/LICENSE-2.0 Unless required by applicable law or agreed to in writing, software distributed under the License is distributed on an "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied. See the License for the specific language governing permissions and limitations under the License.
es: Licencia bajo la Apache License, Versión 2.0 (la "Licencia"); no puede usar esta aplicación si no es de conformidad con la Licencia. Puede obtener una copia de la Licencia en http://www.apache.org/licenses/LICENSE-2.0 A menos que lo exija la ley aplicable o se acuerde por escrito, el software distribuido bajo la Licencia se distribuye "TAL CUAL", SIN GARANTÍAS NI CONDICIONES DE NINGÚN TIPO, ni expresas ni implícitas. Consulte la Licencia para conocer el lenguaje específico que rige los permisos y limitaciones bajo la Licencia.

source: Rename
es: Renombrar

source: Search
es: Buscar

source: Close Diagram
es: Cerrar diagrama

source: Quit Gaphor
es: Salir de Gaphor

source: Files
es: Archivos

source: Open a Model…
es: Abrir un modelo…

source: Undo and Redo
es: Deshacer y rehacer

source: Selections
es: Selecciones

source: Select All
es: Seleccionar todo

source: Deselect All
es: Deseleccionar todo

source: Copy and Paste
es: Copiar y pegar

source: Copy
es: Copiar

source: Cut
es: Cortar

source: Paste (link defining elements)
es: Pegar (enlaces de elementos de definición)

source: Paste (copy defining elements)
es: Pegar (copiar elementos de definición)

source: Update diagram “{name}”
es: Actualizar diagrama “{name}”

source: Update element “{name}”
es: Actualizar elemento “{name}”

source: Update element of type “{type}”
es: Actualizar elemento de tipo “{type}”

source: Update presentation “{type}”
es: Actualizar presentación “{type}”

source: Add presentation of type {type}
es: Añadir presentación de tipo {type}

source: Remove presentation of type {type}
es: Eliminar presentación de tipo {type}

source: Update presentation “{name}”
es: Actualizar presentación “{name}”

source: Update presentation of type {type}
es: Actualizar presentación de tipo {type}

source: Add {type} “{name}”
es: Añadir {type} “{name}”

source: Add element of type {type}
es: Añadir elemento de tipo {type}

source: Remove element “{name}”
es: Eliminar elemento “{name}”

source: Remove element of type {type}
es: Eliminar elemento de tipo {type}

source: Update element of type {type}
es: Actualizar elemento de tipo {type}

source: Add relation “{name}” to “{ref_name}”
es: Añadir relación “{name}” a “{ref_name}”

source: Remove relation “{name}” to “{ref_name}”
es: Eliminar relación “{name}” a “{ref_name}”

source: Update relation “{name}” to “{ref_name}”
es: Actualizar relación “{name}” a “{ref_name}”

source: Add relation “{name}”
es: Añadir relación “{name}”

source: Remove relation “{name}”
es: Eliminar relación “{name}”

source: Update relation “{name}”
es: Actualizar relación “{name}”
